Repository: NuSerraLopes/truck_booking_app_original_test
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: A user with that email already exists.
pt: Já existe um utilizador com esse email.

source: User '{user.username}' created with temporary password: '{random_password}'. They will be required to change it on first login.
pt: Utilizador '{user.username}' criado com password temporária: '{random_password}'. Será necessário alterá-la no primeiro login.

source: The two password fields didn't match.
pt: As duas passwords não coincidem.

source: Personal info
pt: Informação Pessoal

source: Permissions
pt: Permissões

source: Important dates
pt: Datas Importantes

source: Client Name
pt: Nome do Cliente

source: Client Tax Number
pt: Número de Contribuinte do Cliente

source: Client Address
pt: Morada do Cliente

source: Client Email
pt: Email do Cliente

source: Client Phone
pt: Telefone do Cliente

source: Client CRC
pt: CRC do Cliente

source: Submit Booking Request
pt: Submeter Pedido de Reserva

source: Please provide either a Client Email or a Client Phone Number.
pt: Por favor, forneça pelo menos um método de contacto: um endereço de email ou um número de telefone.

source: End date must be after start date.
pt: A data de fim deve ser posterior à data de início.

source: The selected date range conflicts with an existing booking (ID: %(booking_id)s) for this vehicle from %(start)s to %(end)s.
pt: O intervalo de datas selecionado entra em conflito com uma reserva existente (ID: %(booking_id)s) para este veículo de %(start)s a %(end)s.

source: This field is required for APV bookings.
pt: Este campo é obrigatório para reservas APV.

source: Final kilometers (%(final)s) must be greater than the initial kilometers (%(initial)s).
pt: Os quilómetros finais (%(final)s) devem ser superiores aos quilómetros iniciais (%(initial)s).

source: Upload CSV File
pt: Enviar arquivo CSV

source: The file must be in CSV format with the correct headers.
pt: O arquivo deve estar no formato CSV com os cabeçalhos corretos.

source: Group Members
pt: Membros do Grupo

source: Filter by Status
pt: Filtrar por estado

source: All Actionable
pt: Tudo acionável

source: Pending Approval
pt: Aguardando aprovação

source: Pending Contract
pt: Pendente de Contrato

source: Confirmed / Upcoming
pt: Confirmado / Próximo

source: Completed
pt: Concluído

source: Cancelled
pt: Cancelado

source: Pending Final KM
pt: Pendente KM final

source: Automatically cancelled due to non-approval before start date.
pt: Cancelado automaticamente devido ao facto de não ter sido aprovado antes da data de início.

source: Inactive User
pt: Utilizador Inactivo

source: Inactive Users
pt: Utilizadores Inactivos

source: License Plate of the vehicle.
pt: A matrícula do veículo.

source: Vehicle Type (LIGHT, HEAVY, APV).
pt: Tipo de veículo (LIGHT, HEAVY, APV).

source: Is Vehicle Available.
pt: Veiculo Está Disponível.

source: Model Name
pt: Nome do Modelo

source: The Model of the vehicle.
pt: O nome do modelo do veículo.

source: ID of the ViaVerde Identifier.
pt: ID do identificador ViaVerde.

source: The KM of the vehicle.
pt: KM do Veículo.

source: Chassis Number
pt: Número do Chassis

source: The unique chassis number of the vehicle.
pt: O Número do Chassis unico do veículo.

source: Picture
pt: Fotografia

source: Upload a picture of the vehicle.
pt: Carregue uma fotografia do veículo.

source: Insurance
pt: Seguro

source: Upload the vehicle's insurance document (PDF, DOCX, etc.).
pt: Carregue o documento de seguro do veículo (PDF, DOCX, etc.).

source: Registration
pt: Registo

source: Upload the vehicle's registration document (PDF, DOCX, etc.).
pt: Carregue o documento de registo do veículo (PDF, DOCX, etc.).

source: Current Location
pt: Localização Atual

source: The current physical location of the vehicle.
pt: A localização física atual do veículo.

source: Next Maintenance Date
pt: Próxima data de manutenção

source: Required only for APV vehicles.
pt: Obrigatório apenas para veículos APV.

source: Available From
pt: Disponível a Partir de

source: Tax Number
pt: Número de Contribuinte (NIF)

source: Full Name
pt: Nome Completo

source: Address
pt: Morada

source: Email Address
pt: Endereço de email

source: Phone Number
pt: Número de Telefone

source: Client
pt: Cliente

source: Clients
pt: Clientes

source: Pending
pt: Pendente

source: Confirmed
pt: Confirmado

source: Booking Status
pt: Estado da Reserva

source: Cancelled By
pt: Cancelado por

source: Cancellation Reason
pt: Motivo do cancelamento

source: Cancellation Time
pt: Hora de cancelamento

source: Initial Kilometers
pt: Quilómetros iniciais

source: The vehicle's kilometers at the start of the booking.
pt: Os quilómetros do veículo no início da reserva.

source: Final Kilometers
pt: Quilómetros finais

source: The vehicle's kilometers at the end of the booking.
pt: Os quilómetros do veículo no final da reserva.

source: Motive
pt: Motivo

source: Required only for APV vehicle bookings.
pt: Necessário apenas para reservas de veículos APV.

source: Created At
pt: Criado em

source: The date and time the booking was created.
pt: A data e a hora em que a reserva foi criada.

source: Transport Required Before Booking
pt: Transporte necessário antes da reserva

source: Indicates if the vehicle needs to be moved from a different location before this booking can start.
pt: Indica se o veículo precisa ser movido de um local diferente antes que esta reserva possa começar.

source: On Going
pt: Em curso

source: N/A
pt: N/D

source: Booking
pt: Reserva

source: Bookings
pt: Reservas

source: New LIGHT Vehicle Booking Created
pt: Nova reserva de veículo LIGHT criada

source: New HEAVY Vehicle Booking Created
pt: Nova reserva de veículo HEAVY criada

source: New APV Vehicle Booking Created
pt: Nova reserva de veículo APV criada

source: LIGHT Booking Reverted to Pending
pt: Reserva LIGHT revertida para pendente

source: HEAVY Booking Reverted to Pending
pt: Reserva HEAVY revertida para pendente

source: APV Booking Reverted to Pending
pt: Reserva APV revertida para pendente

source: Booking Canceled by Manager
pt: Reserva cancelada pelo Manager

source: Booking Canceled by User
pt: Reserva cancelada pelo utilizador

source: Booking Completed
pt: Reserva Concluída

source: Booking Pending Reminder
pt: Lembrete de reserva pendente

source: Booking Transport Status Changed
pt: Estado de transporte da reserva alterou

source: Booking Ended Pending KM
pt: Pendente KM final

source: Booking Approved
pt: Reserva aprovada

source: APV Booking Approved
pt: Reserva APV aprovada

source: Send User Credentials
pt: Enviar credenciais de utilizador

source: Send Temporary Password
pt: Enviar palavra-passe temporária

source: Booking Reminder (7 Days Away)
pt: Lembrente de reserva (A 7 dias)

source: Booking Auto-Cancelled (Unapproved)
pt: Reserva cancelada cancelada automaticamente (Não aprovada)

source: New User Account Created
pt: Nova conta de utilizador criada

source: User Password Was Reset
pt: A palavra-passe do utilizador foi redefinida

source: Vehicle Created
pt: Veículo Criado

source: Vehicle Updated
pt: Veículo Actualizado

source: Vehicle Deleted
pt: Veículo Removido

source: Location Created
pt: Localização Criada

source: Location Updated
pt: Localização Actualizada

source: Location Deleted
pt: Localização Removida

source: For your security, you must change your password before proceeding.
pt: Para sua segurança, deve alterar a sua palavra-passe antes de prosseguir.

source: Invalid username or password.
pt: Nome de utilizador ou password inválidos.

source: You have successfully logged out.
pt: Terminou a sessão com sucesso.

source: Form is not valid. Please check the errors.
pt: O formulário não é válido. Verifique os erros.

source: Please resolve the client data conflict below.
pt: Resolva o conflito de dados do cliente abaixo.

source: Your booking request has been submitted successfully!
pt: O seu pedido de reserva foi submetido com sucesso!

source: Booking has been updated successfully.
pt: A reserva foi atualizada com sucesso.

source: An unknown error occurred. Could not determine a client to save.
pt: Ocorreu um erro desconhecido. Não foi possível determinar um cliente para guardar.

source: This booking cannot be cancelled.
pt: Esta reserva não pode ser cancelada.

source: Cancelled by user.
pt: Reserva cancelada pelo utilizador.

source: Booking cancelled successfully.
pt: Reserva cancelada com sucesso.

source: Vehicle Fleet
pt: Frota Veiculos

source: Vehicle Details
pt: Detalhes do Veículo

source: Vehicle created successfully!
pt: Veículo criado com sucesso!

source: Create New Vehicle
pt: Criar Novo Veículo

source: Vehicle updated successfully!
pt: Veículo atualizado com sucesso!

source: Manage Vehicles
pt: Gerir Veículos

source: Admin Vehicle Details
pt: Detalhes do Veículo (Admin)

source: Location created successfully!
pt: Localização criada com sucesso!

source: Create New Location
pt: Criar Nova Localização

source: Manage Clients
pt: Gerir Clientes

source: Client created successfully.
pt: Cliente criado com sucesso.

source: Create New Client
pt: Criar como novo cliente

source: Client updated successfully.
pt: Cliente atualizado com sucesso.

source: Edit Client: {client.name}
pt: Editar Cliente: {client.name}

source: Confirm Deletion
pt: Confirmar eliminação

source: Group created successfully!
pt: Grupo criado com sucesso!

source: User '{user.username}' created successfully.
pt: Utilizador '{user.username}' criado com sucesso.

source: Manage Active Users
pt: Gerir Utilizadores Activos

source: Manage Inactive Users
pt: Gerir Utilizadores inactivos

source: You cannot deactivate your own account.
pt: Não é possível desativar sua própria conta.

source: User '{user_to_deactivate.username}' has been deactivated.
pt: Utilizador '{user_to_deactivate.username}' foi desactivado com sucesso!

source: User '{user_to_reactivate.username}' has been reactivated.
pt: O utilizador '{user_to_reactivate.username}' foi reactivado com sucesso!

source: User '{user_to_edit.username}' updated successfully!
pt: Utilizador '{user_to_edit.username}' atualizado com sucesso!

source: Password for user '{user_to_reset.username}' has been reset successfully!
pt: A password para o utilizador '{user_to_reset.username}' foi redefinida com sucesso!

source: Email template '{instance.name}' saved successfully!
pt: Template de email '{instance.name}' guardado com sucesso!

source: Test email for '{template.name}' sent to {request.user.email}.
pt: E-mail de teste para ‘{template.name}’ enviado para {request.user.email}.

source: Failed to send test email for '{template.name}'. Error: {e}
pt: Falha no envio da mensagem de correio eletrónico de teste '{template.name}'. Erro: {e}

source: Distribution list saved successfully!
pt: Lista de distribuição guardada com êxito!

source: Distribution list deleted successfully!
pt: Lista de distribuição eliminada com êxito!

source: Automation settings updated successfully.
pt: Definições de automatização atualizadas com sucesso.

source: Booking History for {client.name} (Tax ID: {tax_number})
pt: Histórico de reservas para {client.name} (NIF: {tax_number})

source: This client cannot be deleted because they have existing bookings.
pt: Este cliente não pode ser eliminado porque tem reservas existentes.

source: CRC code is required.
pt: É necessário o código CRC.

source: Company not found or CRC is invalid.
pt: Empresa não encontrada ou CRC inválido.

source: Country code and VAT number are required.
pt: É necessário indicar o código do país e o NIF.

source: Invalid VAT number.
pt: O NIF é inválido.

source: Could not connect to VIES service.
pt: Não foi possível estabelecer ligação com o serviço VIES.

source: You do not have permission to access this booking.
pt: Não tem permissão para gerir esta reserva.

source: Your personal data was successfully updated!
pt: Os seus dados pessoais foram atualizados com sucesso!

source: Your password was successfully updated!
pt: A sua password foi atualizada com sucesso!

source: Group Dashboard
pt: Painel do grupo

source: You do not have permission to view this group booking.
pt: Não tem permissão para ver esta reserva de grupo.

source: Group Booking Details
pt: Detalhes da Reserva de Grupo

source: Admin Dashboard
pt: Painel de Administração

source: This is not a CSV file. Please upload a valid .csv file.
pt: Este não é um arquivo CSV. Carregue um arquivo .csv válido.

source: Successfully imported {len(vehicles_to_create)} vehicles.
pt: Importou {len(vehicles_to_create)} veículos com sucesso.

source: An unexpected error occurred: {e}
pt: Ocorreu um erro: {e}

source: Import Vehicles from CSV
pt: Importar veículos de CSV

source: Group Reports & Charts
pt: Relatórios e gráficos do grupo

source: Group Bookings Calendar
pt: Calendário de reservas do grupo

source: Email Logs
pt: Registos de correio eletrónico

source: first
pt: primeira

source: previous
pt: anterior

source: Page %(current_page)s of %(total_pages)s
pt: Página %(current_page)s de %(total_pages)s

source: next
pt: próxima

source: last
pt: última

source: Pending Booking Reminders
pt: Lembretes de reservas pendentes

source: Settings for sending automatic reminders for bookings that have been pending for too long.
pt: Configurações para enviar lembretes automáticos para reservas que estão pendentes há muito tempo.

source: Save Settings
pt: Guardar Alterações

source: Back to Dashboard
pt: Voltar ao Painel de Administração

source: Are you sure you want to delete the client <strong>%(client_name)s</strong>?
pt: Tem a certeza de que deseja eliminar o cliente <strong>%(client_name)s</strong>?

source: This action cannot be undone.
pt: Esta ação não pode ser desfeita.

source: Cancel
pt: Cancelar

source: Yes, Delete Client
pt: Sim, eliminar cliente

source: Add New Client
pt: Adicionar Novo Cliente

source: Name
pt: Nome

source: Phone
pt: Telefone

source: Actions
pt: Ações

source: Edit
pt: Editar

source: Delete
pt: Eliminar

source: No clients found.
pt: Nenhum cliente encontrado.

source: Back to Admin Dashboard
pt: Voltar ao Painel de Administração

source: User Management
pt: Gestão de Utilizadores

source: Manage user accounts, permissions, and groups.
pt: Gerir contas de utilizador, permissões e grupos.

source: View All Users
pt: Ver Todos os Utilizadores

source: Group Management
pt: Gestão de Grupos

source: Manage user groups and their permissions.
pt: Gerir grupos de utilizadores e as suas permissões.

source: Manage Groups
pt: Gerir Grupos

source: Vehicle Management
pt: Gestão de Veículos

source: Add, edit, and manage the vehicle fleet.
pt: Adicionar, editar e gerir a frota de veículos.

source: View All Vehicles
pt: Ver Todos os Veículos

source: Location Management
pt: Gestão de Localizações

source: Manage pickup and drop-off locations.
pt: Gerir localizações de recolha e entrega.

source: View All Locations
pt: Ver Todas as Localizações

source: Email Templates
pt: Templates de Email

source: Edit the content of notification emails.
pt: Editar o conteúdo dos emails de notificação.

source: Manage Email Templates
pt: Gerir Templates de Email

source: Distribution Lists
pt: Listas de distribuição

source: Manage email lists for notifications.
pt: Gerir listas de correio eletrónico para notificações.

source: Manage Distribution Lists
pt: Gerir listas de distribuição

source: Settings
pt: Definições

source: Manage application settings.
pt: Gerir definições da aplicação.

source: Manage Automation Settings
pt: Gerir Definições automatização

source: Recent Email Logs
pt: Registos de correio eletrónico recentes

source: View recent emails logs of email sent.
pt: Ver os registos de mensagens de correio eletrónico recentes enviadas.

source: View All Logs
pt: Ver todos os registos

source: View, create, edit, and delete client records.
pt: Ver, Criar, editar e apagar registos de clientes.

source: Go to Clients
pt: Ir para Clientes

source: Are you sure you want to delete the distribution list "<strong>%(distribution_list.name)s</strong>"?
pt: Tem a certeza de que pretende eliminar a lista de distribuição “<strong>%(distribution_list.name)s</strong>”?

source: Yes, Confirm Delete
pt: Sim, Confirmar Eliminação

source: Save
pt: Guardar

source: Create New List
pt: Criar nova lista

source: List Name
pt: Nome da Lista

source: Email Addresses
pt: Endereço de email

source: No distribution lists found.
pt: Não foram encontradas listas de distribuição.

source: Status
pt: Estado

source: Recipient
pt: Destinatário

source: Subject
pt: Assunto

source: Time
pt: Tempo

source: Error
pt: Erro

source: Page
pt: Página

source: of
pt: de

source: No email logs found.
pt: Não foram encontrados registos de correio eletrónico.

source: Template Key
pt: Chave do Template

source: Show Available Variables
pt: Mostrar variáveis disponíveis

source: The event trigger cannot be changed after creation.
pt: O acionador de eventos não pode ser alterado após a criação.

source: Save Changes
pt: Guardar Alterações

source: Create Template
pt: Criar Template

source: Available Template Variables
pt: Variáveis de Template Disponíveis

source: Close
pt: Fechar

source: You can use the following variables in the subject and body of the email. They will be replaced with the actual data.
pt: Pode utilizar as seguintes variáveis no assunto e no corpo do e-mail. Elas serão substituídas pelos dados reais.

source: Create New Template
pt: Criar Novo Template

source: Here you can edit the content of the automated notification emails sent to users. The 'Template Key' is used by the system and cannot be changed.
pt: Aqui pode editar o conteúdo dos emails de notificação automáticos enviados aos utilizadores. A 'Chave do Template' é usada pelo sistema e não pode ser alterada.

source: Template Name
pt: Nome do Template

source: Event Trigger
pt: Acionador de Evento

source: Send Test
pt: Enviar teste

source: No email templates found. Please click the button above to create one.
pt: Nenhum template de email encontrado. Por favor, clique no botão acima para criar um.

source: Are you sure you want to delete the group "<strong>%(group_obj.name)s</strong>"?
pt: Tem a certeza que quer eliminar o grupo "<strong>%(group_obj.name)s</strong>"?

source: Update Group
pt: Atualizar Grupo

source: Create Group
pt: Criar Grupo

source: Create New Group
pt: Criar Novo Grupo

source: Group Name
pt: Nome do Grupo

source: No groups found.
pt: Nenhum grupo encontrado.

source: View Active Users
pt: Ver Utilizadores activos

source: Username
pt: Nome de Utilizador

source: Reactivate User
pt: Reactivar Utilizador

source: Reactivate
pt: Reactivar

source: Edit User
pt: Editar Utilizador

source: There are no inactive users.
pt: Não há utilizadores inactivos.

source: Confirm Delete Location
pt: Confirmar Eliminação de Localização

source: Are you sure you want to delete the location
pt: Tem a certeza que quer eliminar a localização

source: Deleting a location may affect existing bookings.
pt: Eliminar uma localização pode afetar reservas existentes.

source: Create Location
pt: Criar Localização

source: Edit Location
pt: Editar Localização

source: Update Location
pt: Actualizar Localização

source: Manage Locations
pt: Gerir Localizações

source: Location Name
pt: Nome da Localização

source: Previous
pt: Anterior

source: Next
pt: Seguinte

source: No locations found.
pt: Nenhuma localização encontrada.

source: Confirm Deactivation
pt: Confirmar desativação

source: Are you sure you want to deactivate the user <strong>%(username)s</strong>?
pt: Tem a certeza de que deseja desativar o utilizador <strong>%(username)s</strong>?

source: This user will no longer be able to log in. You can reactivate them later from the Inactive Users page.
pt: Este utilizador não poderá mais fazer login. Você pode reativá-lo posteriormente na página Utilizadores inativos.

source: Create New User
pt: Criar Novo Utilizador

source: Create User
pt: Criar Utilizador

source: Personal Information
pt: Informação Pessoal

source: Group Assignment
pt: Atribuição de Grupo

source: Update User
pt: Atualizar Utilizador

source: Manage Users
pt: Gerir Utilizadores

source: Active
pt: Ativo

source: Inactive
pt: Inativo

source: Deactivate
pt: Desactivar

source: No active users found.
pt: Nenhum utilizador activo encontrado.

source: Reset Password for
pt: Redefinir Password para

source: Set New Password
pt: Definir Nova Password

source: Back to User List
pt: Voltar à Lista de Utilizadores

source: Create Vehicle
pt: Criar Veículo

source: Are you sure you want to delete the vehicle: <strong>%(vehicle_obj.model)s (%(vehicle_obj.license_plate)s)</strong>?
pt: Tem a certeza que quer eliminar o veículo: <strong>%(vehicle_obj.model)s (%(vehicle_obj.license_plate)s)</strong>?

source: Back to Vehicle List
pt: Voltar à Lista de Veículos

source: No Image Available
pt: Nenhuma Imagem Disponível

source: License Plate
pt: Matrícula

source: Vehicle Type
pt: Tipo de Veículo

source: Last Recorded KM
pt: Último KM registrado

source: ViaVerde ID
pt: ID da Viaverde

source: Electric
pt: Elétrico

source: Yes
pt: Sim

source: No
pt: Não

source: Availability
pt: Disponibilidade

source: Available Now
pt: Disponível Agora

source: Next Available
pt: Próxima disponibilidade

source: Currently Unavailable
pt: Atualmente indisponível

source: Available Slots
pt: Vagas disponíveis

source: From %(start_date)s to %(end_date)s
pt: De %(start_date)s até %(end_date)s

source: From %(start_date)s onwards
pt: A partir de %(start_date)s

source: No upcoming availability found.
pt: Não foi encontrada nenhuma disponibilidade futura.

source: Not Set
pt: Não Definido

source: Insurance Document
pt: Documento de seguro

source: View/Download
pt: Ver/Descarregar

source: Not Uploaded
pt: Não carregado

source: Registration Document
pt: Documento de registo

source: Edit Vehicle
pt: Editar Veículo

source: Booking History
pt: Histórico de Reservas

source: Booking ID
pt: ID da Reserva

source: User
pt: Utilizador

source: Start Date
pt: Data de Início

source: End Date
pt: Data de Fim

source: This vehicle has no upcoming or current bookings.
pt: Este veículo não tem reservas futuras ou atuais.

source: Current Picture:
pt: Imagem atual:

source: Current Insurance:
pt: Seguro atual:

source: View Document
pt: Ver documento

source: Current Registration:
pt: Registo atual:

source: Filter By
pt: Filtrar por

source: All Text Fields (Plate, Model)
pt: Todos campos de texto

source: Model
pt: Modelo

source: Type
pt: Tipo

source: Booked By (Customer)
pt: Reservado Por (Cliente)

source: Location
pt: Localização

source: Value
pt: Valor

source: Filter
pt: Filtro

source: Clear
pt: Limpar

source: Available
pt: Disponível

source: No Image
pt: Sem Imagem

source: Details
pt: Detalhes

source: No vehicles found matching your criteria.
pt: Nenhum veículo encontrado que corresponda aos critérios.

source: Add New Vehicle
pt: Adicionar Novo Veículo

source: Download Template
pt: Descarregar Template

source: Import from CSV
pt: Importar de CSV

source: Variable
pt: Variável

source: Description
pt: Descrição

source: Booking Details
pt: Detalhes da Reserva

source: The unique ID of the booking.
pt: O ID único da reserva.

source: The start date of the booking.
pt: A data de início da reserva.

source: The end date of the booking.
pt: A data de término da reserva.

source: APV Only
pt: Apenas APV

source: Upload a CSV file with vehicle data. The file must contain the correct headers. You can download a template to see the required format.
pt: Carregue um ficheiro CSV com os dados do veículo. O ficheiro deve conter os cabeçalhos corretos. Pode descarregar um modelo para ver o formato necessário.

source: Upload and Import
pt: Carregar e importar

source: Demo Booking App
pt: App de Demonstração de Reservas
