Repository: NuSerraLopes/truck_booking_app_original_test
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: VehicleApp Logo
pt: Logo VehicleApp

source: Demo Booking
pt: Reserva de Demonstração

source: Vehicles
pt: Veiculos

source: My Bookings
pt: As Minhas Reservas

source: My Account
pt: A Minha Conta

source: Welcome
pt: Bem-vindo

source: Logout
pt: Sair

source: Login
pt: Entrar

source: NuLopes.me. All Rights Reserved.
pt: NuLopes.me. Todos os direitos reservados.

source: Found a bug?
pt: Encontrou um erro?

source: Report it on GitHub
pt: Reportar no GitHub

source: Version
pt: Versão

source: Last Updated:
pt: Última atualização:

source: Book Vehicle
pt: Reservar Veículo

source: Book
pt: Reservar

source: Client Data Conflict
pt: Conflito dados de cliente

source: The information you submitted conflicts with an existing client for this Tax Number.
pt: As informações que enviou entram em conflito com um cliente existente para este número fiscal.

source: Detected Changes:
pt: Alterações detetadas:

source: How would you like to proceed?
pt: Como gostaria de proceder?

source: Multiple clients exist with this Tax Number. Please choose an action below.
pt: Existem vários clientes com este número fiscal. Escolha uma das opções abaixo.

source: Existing Clients:
pt: Clientes existentes:

source: Go Back
pt: Retroceder

source: Discard My Changes
pt: Descartar as minhas alterações

source: Update Existing Client
pt: Atualizar cliente existente

source: Use Selected Client (No Changes)
pt: Usar cliente selecionado (sem alterações)

source: Update Selected Client
pt: Atualizar cliente selecionado

source: Create as New Client
pt: Criar como novo cliente

source: Please select a client.
pt: Por favor, selecione um cliente.

source: Pre-fill from DB / VIES
pt: Pré-preenchimento a partir da BD / VIES

source: Pre-filled data for existing client:
pt: Dados pré-preenchidos para cliente existente:

source: Pre-filled data from VIES.
pt: Dados pré-preenchidos do VIES.

source: Please enter a Tax Number first.
pt: Por favor, introduza primeiro um NIF.

source: Verify CRC
pt: Verificar CRC

source: Please enter a Company Registration Code first.
pt: Introduza Código Certidão Permanente primeiro.

source: Looking up company...
pt: Pesquisando empresa...

source: Company found:
pt: Empresa encontrada:

source: Back to My Bookings
pt: Voltar às Minhas Reservas

source: Booking Information
pt: Informação da Reserva

source: Salesperson
pt: Vendedor

source: Start Location
pt: Local de Início

source: End Location
pt: Local de Fim

source: Transport Required
pt: Transporte necessário

source: Vehicle
pt: Veículo

source: Kilometer Log
pt: Registo de quilómetros

source: Initial KM
pt: KM inicial

source: Final KM
pt: KM Finais

source: Client Information
pt: Informação do Cliente

source: Tax Number (NIF)
pt: Número de Contribuinte (NIF)

source: Company Registration
pt: Matrícula da Empresa

source: Motive for Booking
pt: Motivo da reserva

source: Not provided.
pt: Não foi apresentado qualquer motivo.

source: Documents & Files
pt: Documentos e ficheiros

source: Booking Document
pt: Documento de reserva

source: Contract Document
pt: Documento contratual

source: View Contract
pt: Ver contrato

source: Associated Vehicle Files
pt: Ficheiros de veículos associados

source: Vehicle Picture
pt: Fotografia do Veículo

source: View
pt: Ver

source: This booking is finalized and cannot be modified.
pt: Esta reserva já não está ativa e não pode ser modificada.

source: Manage Booking
pt: Gerir Reserva

source: Cancel Booking
pt: Cancelar Reserva

source: Confirm Cancellation
pt: Confirmar Cancelamento

source: Are you sure you want to cancel the following booking?
pt: Tem a certeza que quer cancelar a seguinte reserva?

source: Current Status
pt: Estado Atual

source: No, Go Back
pt: Não, Voltar Atrás

source: Yes, Cancel This Booking
pt: Sim, Cancelar Esta Reserva

source: Change Password
pt: Alterar Password

source: Change Your Password
pt: Altere a Sua Password

source: Client Details
pt: Detalhes do cliente

source: This client has no bookings.
pt: Cliente não tem reservas.

source: Booking Cancellation Confirmation
pt: Confirmação de Cancelamento de Reserva

source: VehicleApp Booking Cancellation
pt: Cancelamento de Reserva VehicleApp

source: Dear
pt: Caro(a)

source: This email confirms that your booking for Vehicle ID
pt: Esta mensagem de correio eletrónico confirma que a sua reserva para o Vehicle ID

source: has been successfully cancelled.
pt: foi cancelada com sucesso.

source: Cancelled Booking Details:
pt: Detalhes da Reserva Cancelada:

source: Vehicle ID
pt: Veículo

source: Customer Name
pt: Nome do Cliente

source: Origin
pt: Origem

source: Destination
pt: Destino

source: Start Time
pt: Hora de Início

source: End Time
pt: Hora de Fim

source: Estimated Cost
pt: Custo Estimado

source: Final Status
pt: Estado Final

source: If you believe this cancellation is an error or have any questions, please contact us immediately.
pt: Se acredita que este cancelamento é um erro ou tem alguma questão, por favor contacte-nos imediatamente.

source: Best regards,
pt: Com os melhores cumprimentos,

source: The VehicleApp Team
pt: A Equipa TruckApp

source: This is an automated email, please do not reply.
pt: Este é um email automático, por favor não responda.

source: Booking Confirmation
pt: Confirmação de Reserva

source: VehicleApp Booking Confirmation
pt: Confirmação de reserva de veículoApp

source: Your booking has been successfully confirmed!
pt: A sua reserva foi confirmada com sucesso!

source: Here are your booking details:
pt: Aqui estão os detalhes da sua reserva:

source: You can view and manage your bookings by logging into your account:
pt: Pode ver e gerir as suas reservas iniciando sessão na sua conta:

source: View My Bookings
pt: Ver as Minhas Reservas

source: Thank you for choosing VehicleApp!
pt: Obrigado por escolher a TruckApp!

source: Booking Update Notification
pt: Notificação de Atualização de Reserva

source: VehicleApp Booking Update
pt: Atualização de Reserva TruckApp

source: Your booking for Vehicle ID
pt: A sua reserva para o Vehicle ID

source: has been updated.
pt: foi atualizada.

source: Here are the revised booking details:
pt: Aqui estão os detalhes revistos da reserva:

source: You can review your updated booking details by logging into your account:
pt: Pode rever os detalhes atualizados da sua reserva iniciando sessão na sua conta:

source: If you have any questions, please do not hesitate to contact us.
pt: Se tiver alguma questão, não hesite em contactar-nos.

source: Back to Group Dashboard
pt: Voltar ao Painel de Grupo

source: Upload Contract
pt: Carregar contrato

source: Generate Word Contract
pt: Gerar contrato Word

source: Manage/Edit Booking
pt: Gerir/Editar reservas

source: Manage Group Booking
pt: Gerir Reservas de Grupo

source: Back to Details
pt: Voltar aos detalhes

source: Approve
pt: Aprovar

source: Approve APV Booking
pt: Aprovar a reserva de APV

source: Finalize & Confirm
pt: Finalizar e confirmar

source: Upload contract before confirming.
pt: Carregar o contrato antes de confirmar.

source: Action Required:
pt: Ação necessária:

source: Please enter the final kilometers to complete this booking.
pt: Por favor, introduza os últimos quilómetros para completar esta reserva.

source: Initial Kilometers Recorded:
pt: Quilómetros iniciais registados:

source: Contract on file:
pt: Contrato em arquivo:

source: View Uploaded Contract
pt: Ver contrato carregado

source: Booking Details (Read-Only)
pt: Detalhes da reserva (somente leitura)

source: Request Final KM
pt: Pedido de KM final

source: Are you sure you want to change the status to CONFIRMED? This action cannot be undone.
pt: Tem a certeza de que pretende alterar o estado para CONFIRMADO? Esta ação não pode ser anulada.

source: View Reports & Charts
pt: Ver relatórios e gráficos

source: Open Calendar
pt: Abrir o calendário

source: Dates
pt: Datas

source: Transport?
pt: Transporte?

source: View client history
pt: Ver histórico do cliente

source: History
pt: Histórico

source: Legacy Booking
pt: Reservas antigas

source: Manage
pt: Gerir

source: No bookings match the selected filter.
pt: Nenhuma reserva corresponde ao filtro selecionado.

source: Bookings Per Month (Last 12 Months)
pt: Reservas por mês (últimos 12 meses)

source: Top 10 Most Booked Vehicles
pt: Os 10 veículos mais reservados

source: Vehicle Usage Data
pt: Dados de utilização do veículo

source: Total Bookings
pt: Total de reservas

source: No booking data available.
pt: Não há dados de reserva disponíveis.

source: Number of Bookings
pt: Número de reservas

source: Home
pt: Início

source: Welcome to Iveco Demo Booking App!
pt: Bem-vindo à App de Demonstração de Reservas Iveco!

source: A new way of bookings demonstration vehicles for your clients.
pt: Uma nova forma de reservar veículos de demonstração para os seus clientes.

source: Here you can find the right truck for you next sale.
pt: Aqui pode encontrar o veiculo certo para a sua próxima venda.

source: Browse Available Vehicles
pt: Procurar Veiculos Disponíveis

source: Please log in to browse available trucks and manage your bookings.
pt: Por favor, inicie sessão para procurar veiculos disponíveis e gerir as suas reservas.

source: First Name
pt: Primeiro Nome

source: Last Name
pt: Último Nome

source: Language
pt: Língua

source: Account Actions
pt: Ações da Conta

source: Update Personal Data & Language
pt: Atualizar dados pessoais e língua

source: My Recent Bookings
pt: As Minhas Reservas Recentes

source: View All My Bookings
pt: Ver Todas as Minhas Reservas

source: You have no bookings yet.
pt: Ainda não tem reservas.

source: List View
pt: Vista de lista

source: Calendar View
pt: Vista de calendário

source: View Details
pt: Ver detalhes

source: You have no bookings.
pt: Não tem reservas.

source: Vehicle Model
pt: Modelo do Veículo

source: Booked By
pt: Reservado Por

source: No Actions
pt: Sem Ações

source: No bookings found matching your group's criteria.
pt: Nenhuma reserva encontrada que corresponda aos critérios do seu grupo.

source: Back to Home
pt: Voltar ao Início

source: Forgot password?
pt: Esqueceu-se da password?

source: Don't have an account?
pt: Não tem uma conta?

source: Please contact your manager to get access.
pt: Por favor, contacte o seu gestor para obter acesso.

source: Update Booking
pt: Atualizar Reserva

source: Update Your Personal Data
pt: Atualize os Seus Dados Pessoais

source: Username cannot be changed.
pt: O nome de utilizador não pode ser alterado.

source: Not Available
pt: Não disponível

source: Book This Vehicle
pt: Reservar Este Veículo

source: From %(start_date)s to %(end_date)s
pt: De %(start_date)s até %(end_date)s

source: From %(start_date)s onwards
pt: A partir de %(start_date)s

source: Book Now
pt: Reservar Agora

source: No vehicles found.
pt: Nenhum veículo encontrado.
